Revit 2027 API
ParameterTypeId.AnalyticalRoughness Property
 "Roughness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalRoughness { get; }
Public Shared ReadOnly Property AnalyticalRoughness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalRoughness {
	ForgeTypeId^ get ();
}
static member AnalyticalRoughness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace